import os,sys 
parentdir = os.path.dirname(os.path.dirname(os.path.abspath(__file__))) 
sys.path.insert(0,parentdir) 

import xmind
from xmind.core.markerref import MarkerId
xmind_name="mysql"
w = xmind.load(os.path.dirname(os.path.abspath(__file__))+"\\"+xmind_name+".xmind") 
s2=w.createSheet()
s2.setTitle("索引简介")
r2=s2.getRootTopic()
r2.setTitle("索引简介")


content={
'索引模型':[
    {'哈希表':[
        '适用等值查询',
        '范围查询慢,不支持模糊查询'
    ]},
    {'有序数组':[
        '等值查询和范围查询较优',
        '查询用二分法，时间复杂度是 O(log(N))',
        '插入成本高',
        '更适合在内存，因为在磁盘插入不方便，也没有这么大的连续空间'
    ]},
    {'搜索树':[
        '以二叉举例',
        '父左子树结点值小于父节点值，右子树结点值大于父节点值',
        '树太高，访问磁盘频繁（索引不止在内存，还在磁盘）',
        {'B+树':[
            '多路平衡查找树,查询从根节点出发,查找到叶子节点,同层级的节点间有指针相互链接，是有序的'
        ]}
    ]}
],
'InnoDB 的索引模型':[
    {'B+树':[
        {'适合磁盘存储与读取':[
            'N=1200,树高4,存1200的3次方,17 亿',
            '树根放内存，查值最多访问3次磁盘',
            '配合磁盘特性，减少单次查询的磁盘访问数'
        ]},
        {'插入':[
            '当前结点key<=m-1，插入结束',
            '否则叶子结点分裂，左叶子结点含前m/2个记录，右结点含剩下的，第m/2+1个记录的key进位到父结点中'
        ]},
        {'删除':[
            '结点的key>=Math.ceil(m/2)–1，删除结束',
            '否则若兄弟结点有富余，父结点key下移，兄弟结点key上移',
            '或当前结点和兄弟结点及父结点下移key合并成一个新的结点'
        ]}

    ]},
    '表:根据主键顺序以索引的形式存放',
    '每一个索引在 InnoDB 里对应一棵 B+ 树',
    {'类型':[
        {'主键索引':[
            '叶子节点存整行数据'
        ]},
        {'非主键索引':[
            '叶子节点存主键的值',
            '回表：回到主键索引树搜索'
        ]}
    ]},
    {'索引维护':[
        '页分裂：数据页满了，申请一个新的数据页，挪部分数据过去',
        '页合并：相邻两个页由于删除了数据，利用率很低后'
    ]},
    {'重建索引':[
        '建一个新索引，数据按顺序插入，页面利用率变高',
        '解决：因页分裂导致的数据页有空洞',
        '重建主键索引：alter table T engine=InnoDB'
    ]}
],
'B树和B+树的区别':[
    {'B树':[
        '每个节点都存储key和data，所有节点组成这棵树',
        '叶子节点指针为null，叶子结点不包含任何关键字信息'
    ]},
    {'B+树':[
        '所有的叶子结点中包含了全部关键字的信息，及指向含有这些关键字记录的指针',
        '叶子结点本身依关键字的大小自小而大的顺序链接',
        '所有的非终端结点可以看成是索引部分，结点中仅含有其子树根结点中最大（或最小）关键字'
    ]}
]
}

#构建xmind
xmind.build(content,r2)
#保存xmind
xmind.save(w,os.path.dirname(os.path.abspath(__file__))+"\\"+xmind_name+".xmind") 